#

# Merging on Index

#### In this case, you can pass left_index=True or right_index=True (or Both) to indicate that the index should be used as the merge Key

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
left1=pd.DataFrame({'key':['a','b','a','a','b','c']})

In [7]:
right1=pd.DataFrame({'group_val':[3.5,7]},index=['a','b'])

In [8]:
left1

  key
0   a
1   b
2   a
3   a
4   b
5   c

In [9]:
right1

   group_val
a        3.5
b        7.0

In [13]:
left1.merge(right1,left_on='key',right_index=True)

  key  group_val
0   a        3.5
2   a        3.5
3   a        3.5
1   b        7.0
4   b        7.0

In [15]:
left1.merge(right1,left_on='key',right_index=True,how='outer')#its consider all values of key

  key  group_val
0   a        3.5
2   a        3.5
3   a        3.5
1   b        7.0
4   b        7.0
5   c        NaN

# Hierarchically Index

In [16]:
lefth=pd.DataFrame({'key1':['A','A','A','B','B'],'key2':[2000,2001,2002,2001,2002],'data':np.arange(5.0)})

In [17]:
lefth

  key1  key2  data
0    A  2000   0.0
1    A  2001   1.0
2    A  2002   2.0
3    B  2001   3.0
4    B  2002   4.0

In [19]:
right=pd.DataFrame(np.arange(12).reshape(6,2),index=[['B','B','A','A','A','A'],[2001,2000,2000,2000,2001,2002]],
                   columns=['event1','event2'])

In [20]:
right

        event1  event2
B 2001       0       1
  2000       2       3
A 2000       4       5
  2000       6       7
  2001       8       9
  2002      10      11

In [22]:
pd.merge(lefth,right,left_on=['key1','key2'],right_index=True)

  key1  key2  data  event1  event2
0    A  2000   0.0       4       5
0    A  2000   0.0       6       7
1    A  2001   1.0       8       9
2    A  2002   2.0      10      11
3    B  2001   3.0       0       1

In [23]:
pd.merge(lefth,right,left_on=['key1','key2'],right_index=True,how='outer')

  key1  key2  data  event1  event2
0    A  2000   0.0     4.0     5.0
0    A  2000   0.0     6.0     7.0
1    A  2001   1.0     8.0     9.0
2    A  2002   2.0    10.0    11.0
3    B  2001   3.0     0.0     1.0
4    B  2002   4.0     NaN     NaN
4    B  2000   NaN     2.0     3.0

# using the index of both sides of the merge is also possible

In [26]:
x=pd.DataFrame([[1,2],[3,4],[5,6]],index=['a','c','e'],columns=['x','y'])

In [30]:
y=pd.DataFrame([[7,8],[9,10],[11,12],[13,14]],columns=['P','Q'])

In [31]:
x

   x  y
a  1  2
c  3  4
e  5  6

In [32]:
y

    P   Q
0   7   8
1   9  10
2  11  12
3  13  14

In [35]:
pd.merge(x,y,left_index=True,right_index=True,how='outer')

     x    y     P     Q
a  1.0  2.0   NaN   NaN
c  3.0  4.0   NaN   NaN
e  5.0  6.0   NaN   NaN
0  NaN  NaN   7.0   8.0
1  NaN  NaN   9.0  10.0
2  NaN  NaN  11.0  12.0
3  NaN  NaN  13.0  14.0

In [36]:
x.join(y,how='outer')

     x    y     P     Q
a  1.0  2.0   NaN   NaN
c  3.0  4.0   NaN   NaN
e  5.0  6.0   NaN   NaN
0  NaN  NaN   7.0   8.0
1  NaN  NaN   9.0  10.0
2  NaN  NaN  11.0  12.0
3  NaN  NaN  13.0  14.0